[
    {
        "url": "https://www.brookings.edu/articles/why-donald-trump-won-and-kamala-harris-lost-an-early-analysis-of-the-results/",
        "title": "Why Donald Trump won and Kamala Harris lost: An early analysis of the results",
        "keywords": "No keywords found",
        "paragraphs": [
            "Commentary",
            "",
            "November 6, 2024",
            "Campaigns & ElectionsCongressPolitical PartiesPresidency",
            "Governance Studies"
        ]
    },
    {
        "url": "https://www.economist.com/interactive/us-2024-election/trump-harris-polls",
        "title": "Kamala Harris v Donald Trump: presidential polls | The Economist",
        "keywords": "No keywords found",
        "paragraphs": [
            "Voting intention, %",
            "At 60, Ms Harris is more than two decades younger than Joe Biden, whom she replaced as the Democratic nominee. Her mother was an endocrinologist born in India; her father is an economist born in Jamaica. In California she won elections as a prosecutor by leaning to the right on criminal-justice issues, while also appealing to Democrats, and was elected as the stateâs attorney-general in 2010. Since she came to Washington, first as a senator in 2017, Ms Harris has been most effective at debates and hearings, where her skills as a litigator are on display.",
            "She is a creature of institutional politics, not a visionary or an ideologue, and has struggled to define herself on a national stage. Her presidential run in 2020 crashed badly. As vice-president she is tied to the Biden administrationâs record, which is unpopular despite the major legislation it passed to onshore chip manufacturing and invest in green energy. If she isto beat Mr Trumpshe will need to answerhis attack lineson immigration directly and lay out a more ambitious domestic policy agenda than Mr Biden was able to communicate.",
            "Mr Trumpâs extraordinary campaign follows his no less remarkable term as Americaâs 45th president, which concluded shortly after his supporters staged a violent attack on the Capitol. His alleged role in instigating the attack and a broader effort to overturn results of the 2020 election resulted in two criminal indictments, in federal court and Georgia state court. A judge he appointed dismissed a further felony indictment against him, though prosecutors are appealing. The 78-year-old denies all wrongdoing. Mr Trump is a billionaire who made (and lost) much of his money in real estate, before he became a reality-TVstar. This time his campaign pairs familiar culture-war issues (building a border wall, âleft-wing gender insanityâ) with fresh grievances (against the lawyers prosecuting his cases and the judges overseeing them).",
            "On July 13th a gunman shot Mr Trump at a campaign rally in Pennsylvania, grazing the former presidentâs ear but otherwise leaving him unharmed (a bystander was killed). Afterwards Mr Trump briefly seemed a changed candidate, trying to present himself as a unifier in a speech at the Republican convention in Milwaukee. But he went back to his past ways quickly, throwing insults at his political opponents."
        ]
    },
    {
        "url": "https://www.nytimes.com/interactive/2024/us/elections/polls-president.html",
        "title": "Kamala Harris vs. Donald Trump: Latest Polls in 2024 Presidential Election - The New York Times",
        "keywords": "No keywords found",
        "paragraphs": [
            "",
            "Nate CohnChief political analyst",
            "It’s Election Day, and the polls showone of the closest presidential races in the history of American politics. Nationwide or across the key battlegrounds collectively, neither Kamala Harris nor Donald J. Trump leads by more than a single percentage point. Neither candidate holds a meaningful edge in enough states to win 270 electoral votes. In the history of modern polling, there’s never been a campaign where the final polls showed such a close contest.Updated Nov. 5",
            "Nate CohnChief political analyst",
            "It’s Election Day, and the polls showone of the closest presidential races in the history of American politics. Nationwide or across the key battlegrounds collectively, neither Kamala Harris nor Donald J. Trump leads by more than a single percentage point. Neither candidate holds a meaningful edge in enough states to win 270 electoral votes. In the history of modern polling, there’s never been a campaign where the final polls showed such a close contest.Updated Nov. 5"
        ]
    },
    {
        "url": "https://timesofindia.indiatimes.com/world/us/2024-us-presidential-election-results-state-wise-winner-list-donald-trump-vs-kamala-harris-full-and-final-list-of-winnersin50states/articleshow/115008237.cms",
        "title": "2024 US presidential election results, state wise winner list: Trump vs Harris; Who's winning which state? Here's state-by-state breakdown of winners | World News - Times of India",
        "keywords": "US presidential election 2024,states won by Kamala Harris,states won by Donald Trump,Electoral vote count,Electoral College votes",
        "paragraphs": [
            "At TOI World Desk, our dedicated team of seasoned journalists and passionate writers tirelessly sifts through the vast tapestry of global events to bring you the latest news and diverse perspectives round the clock. With an unwavering commitment to accuracy, depth, and timeliness, we strive to keep you informed about the ever-evolving world, delivering a nuanced understanding of international affairs to our readers. Join us on a journey across continents as we unravel the stories that shape our interconnected world.Read More",
            "10 easy South Indian snacks for Friday evenings",
            "7 genetic traits that babies get from their dad",
            "â10 good habits of parents that make kids disciplinedâ",
            "7 low-maintenance animals to keep as pets"
        ]
    },
    {
        "url": "https://www.theguardian.com/us-news/ng-interactive/2024/nov/06/us-election-results-map-2024-live-donald-trump-kamala-harris-president",
        "title": "US election 2024 results live: Donald Trump wins presidency, defeating Kamala Harris | US elections 2024 | The Guardian",
        "keywords": "No keywords found",
        "paragraphs": [
            "Live election results and maps as Trump wins the White House",
            "74,327,659 votes (48.0%)",
            "76,838,984 votes (50.0%)",
            "51 / 51states called (includes DC)",
            ""
        ]
    },
    {
        "url": "https://ig.ft.com/us-elections/2024/results/president/",
        "title": "Trump vs Harris: live results map of the US presidential election",
        "keywords": "No keywords found",
        "paragraphs": [
            "Full live details of the election between Donald Trump and Kamala Harris from every state and county in the US",
            "Share",
            "Next update in0seconds",
            "56of56racescalled",
            "89.0%of precincts reporting"
        ]
    },
    {
        "url": "https://www.ndtv.com/world-news/us-elections-results-2024-live-updates-kamala-harris-and-donald-trump-presidential-election-results-6948523",
        "title": "US Election Results 2024 Highlights: Biden Congratulates Trump On Win, Invites Him To White House",
        "keywords": "Kamala Harris,US Election 2024,Donald Trump,US Election News,US Election Latest,Latest In US Election,Voting In US Election,us electons 2024,us presidential elections 2024,US elections,US Elections 2024,US presidential elections,US President Donald Trump,harris ahead of trump,Harris and Trump,us elections 2024 news,us elections 2024 update,Trump vs Harris,kamala harris US election,US election latest news,US election day,Trump vs harris live,Who is winning the election right now",
        "paragraphs": [
            "US Elections Results:Donald Trump has won the US elections, winning a landslide victory in swing states. His rival Kamala Harris has secured 226 electoral colleges, while Trump has won 295—crossing the majority mark of 270. He will be the second Republican to get a second term in office in 20 years. George Bush, a Republican, was president from 2001 to 2009.",
            "As far as swing states are concerned, Trump has already won the swing states of Georgia, North Carolina, Pennsylvania, Michigan, Wisconsin, and is leading in the other two - Arizona, and Nevada.",
            "Kamala Harris conceded defeat early morning.In her speech, the Democratic leader said though she has conceded the election, she has not conceded \"the fight that fuelled this campaign.\"",
            "In a speech that lasted less than 15 minutes, Harris admitted it was painful to lose but urged her supporters to \"keep fighting\".",
            "\"The outcome of this election is not what we wanted, not what we fought for, not what we voted for, but hear me when I say that the light of America's promise will always burn bright as long as we never give up and as long as we keep fighting,\" she told supporters."
        ]
    }
]